---
kind: method
id: M:Autodesk.Revit.DB.FailureMessage.Dispose
source: html/963d1764-0f3a-f465-8b3b-ef5fd8328756.htm
---
# Autodesk.Revit.DB.FailureMessage.Dispose Method

Releases all resources used by the FailureMessage

## Syntax (C#)
```csharp
public void Dispose()
```